Updating-nix-channels.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-07-26 Tue 23:16 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Updating nix channels</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta property="og:title" content="Updating nix channels">
<meta property="og:description" content="">
<meta property="description" content="">
<meta property="og:image" content="https://notes.neeasade.net/assets/img/backgrounds/warm.png">
<meta property="og:url" content="https://notes.neeasade.net/Updating-nix-channels.html">
<meta name="twitter:card" content="summary">
<link rel='stylesheet' href='/assets/css/colors.css?sum=abd38449620b2223dffce2c948aae610'>
<link rel='stylesheet' href='./assets/css/colors.css?sum=abd38449620b2223dffce2c948aae610'>
<link rel='stylesheet' href='/assets/css/new.css?sum=4868ab8522b4e4059bfc5213fd799d61'>
<link rel='stylesheet' href='./assets/css/new.css?sum=4868ab8522b4e4059bfc5213fd799d61'>
<link rel='stylesheet' href='/assets/css/org.css?sum=19824060f71383b34e196f76ea8c38f1'>
<link rel='stylesheet' href='./assets/css/org.css?sum=19824060f71383b34e196f76ea8c38f1'>
<link rel='stylesheet' href='/assets/css/notes.css?sum=7f1e0aaa36371b978c44c8839ba3713f'>
<link rel='stylesheet' href='./assets/css/notes.css?sum=7f1e0aaa36371b978c44c8839ba3713f'>
</head>
<body>
<div id="content" class="content">
<div style="float: left">
    <a href='/index.html'>Up: arst wow</a>
</div>

<div style="float: right">
    <a href="https://github.com/neeasade/neeasade.github.io/commits/source/posts/2020-01-15-Updating-nix-channels.org">Last edit: <2020-05-03></a>
</div>

<p>
<h1 class=title>Updating nix channels</h1>
</p>


<hr>

<p>
I&rsquo;m always forgetting this:
</p>

<p>
The command <code>nix-channel</code> is used to create aliases which can be referenced in <code>configuration.nix</code>
on nixos. The most important alias is <code>nixos</code>, which is used for the default <code>pkgs</code> reference in
your config. Channels are neat but I personally am not really a fan because it is state that exists
outside of your config. To change the default nix-channel reference:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #606162;"># </span><span style="color: #606162;">nix-channel --list</span>
nixos https://nixos.org/channels/nixos-19.09

<span style="color: #606162;"># </span><span style="color: #606162;">nix-channel --remove nixos</span>
uninstalling <span style="color: #007500;">'nixos-19.09.1861.eb65d1dae62'</span>
building <span style="color: #007500;">'/nix/store/xsk9wjy0dpp7w7d3r3bkzxzaklqdzq6q-user-environment.drv'</span>...
created 0 symlinks<span style="color: #005ec1;"> in</span> user environment

<span style="color: #606162;"># </span><span style="color: #606162;">nix-channel --add 'https://nixos.org/channels/nixos-19.09' nixos</span>

<span style="color: #606162;"># </span><span style="color: #606162;">nix-channel --list</span>
nixos https://nixos.org/channels/nixos-19.09

<span style="color: #606162;"># </span><span style="color: #606162;">nix-channel --update</span>
nixos https://nixos.org/channels/nixos-19.09
</pre>
</div>

<p>
And then updating the nix-channels can be done with:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #606162;"># </span><span style="color: #606162;">nix-channel --update</span>
</pre>
</div>


<p>
<div class='flair'></div>
</p>

<div class='footer-left'>
    <a href='/index.html'>arst wow</a>
</div>

<p>
<div class=footer-center>type: post</div>
</p>

<div class="footer-right">
    <a href="https://raw.githubusercontent.com/neeasade/neeasade.github.io/source/posts/2020-01-15-Updating-nix-channels.org">Page Markup</a>
</div>
</div>
</body>
</html>
